eisup_2019_docmng_integration/src/Documents/ОтменаСкидокНоменклатуры/ОтменаСкидокНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОтменаСкидокНоменклатуры</name>
  <comment>(Упр)</comment>
  <basedOn>Document.УстановкаСкидокНоменклатуры</basedOn>
  <registerRecords>InformationRegister.СкидкиНаценкиНоменклатуры</registerRecords>
  <registerRecords>InformationRegister.СкидкиНоменклатурыНатуральные</registerRecords>
  <registerRecords>InformationRegister.СкидкиНаценкиПоЦеновымГруппам</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Документы</name>
    <attributes>
      <name>УстановкаСкидокНоменклатуры</name>
      <type>
        <types>DocumentRef.УстановкаСкидокНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

eisup_2019_docmng_integration/src/InformationRegisters/СкидкиНаценкиНоменклатуры/СкидкиНаценкиНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СкидкиНаценкиНоменклатуры</name>
  <comment>(Упр)</comment>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ПроцентСкидкиНаценки</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОграничениеСкидкиНаценки</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаНоменклатуры</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Качество</name>
    <type>
      <types>CatalogRef.Качество</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Условие</name>
    <comment>(Общ) Условие скидки-наценки</comment>
    <type>
      <types>EnumRef.УсловияСкидкиНаценки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗначениеУсловия</name>
    <comment>(Общ) Значение условия скидки</comment>
    <type>
      <types>CatalogRef.ВидыДисконтныхКарт</types>
      <types>Number</types>
      <types>CatalogRef.ВидыОплатЧекаККМ</types>
      <types>CatalogRef.ИнформационныеКарты</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ПолучательСкидки</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/InformationRegisters/СкидкиНаценкиПоЦеновымГруппам/СкидкиНаценкиПоЦеновымГруппам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СкидкиНаценкиПоЦеновымГруппам</name>
  <comment>(Упр)</comment>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ПроцентСкидкиНаценки</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОграничениеСкидкиНаценки</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ЦеноваяГруппа</name>
    <type>
      <types>CatalogRef.ЦеновыеГруппы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Качество</name>
    <type>
      <types>CatalogRef.Качество</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Условие</name>
    <comment>(Общ) Условие скидки-наценки</comment>
    <type>
      <types>EnumRef.УсловияСкидкиНаценки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗначениеУсловия</name>
    <comment>(Общ) Значение условия скидки</comment>
    <type>
      <types>CatalogRef.ВидыДисконтныхКарт</types>
      <types>Number</types>
      <types>CatalogRef.ВидыОплатЧекаККМ</types>
      <types>CatalogRef.ИнформационныеКарты</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ПолучательСкидки</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/InformationRegisters/СкидкиНоменклатурыНатуральные/СкидкиНоменклатурыНатуральные.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СкидкиНоменклатурыНатуральные</name>
  <comment>(Упр)</comment>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>СпецПредложение</name>
    <comment>(Общ) Комплект номенклатуры и бонусов</comment>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>ХарактеристикаСпецПредложения</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаНоменклатуры</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Качество</name>
    <type>
      <types>CatalogRef.Качество</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ПолучательСкидки</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/Documents/ОтменаСкидокНоменклатуры/ObjectModule.bsl
Перем мУдалятьДвижения;

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

#Если Клиент Тогда
// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходимое количество копий.
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  НазваниеМакета - строка, название макета.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь) Экспорт

	Если ЭтоНовый() Тогда
		Предупреждение("Документ можно распечатать только после его записи");
		Возврат;
	ИначеЕсли Не УправлениеДопПравамиПользователей.РазрешитьПечатьНепроведенныхДокументов(Проведен) Тогда
		Предупреждение("Недостаточно полномочий для печати непроведенного документа!");
		Возврат;
	КонецЕсли;

	Если Не РаботаСДиалогами.ПроверитьМодифицированность(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;

	Если ТипЗнч(ИмяМакета) = Тип("ДвоичныеДанные") Тогда

		ТабДокумент = УниверсальныеМеханизмы.НапечататьВнешнююФорму(Ссылка, ИмяМакета);
		
		Если ТабДокумент = Неопределено Тогда
			Возврат
		КонецЕсли; 
		
	КонецЕсли;

	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, ttk_ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект), Ссылка);

КонецПроцедуры // Печать()

#КонецЕсли

// Возвращает доступные варианты печати документа
//
// Возвращаемое значение:
//  Структура, каждая строка которой соответствует одному из вариантов печати
//  
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	Возврат Новый Структура;

КонецФункции // ПолучитьСтруктуруПечатныхФорм()

// Выполняет действия при вводе на основании
//
Процедура ЗаполнитьПоОснованию(Основание) Экспорт
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.УстановкаСкидокНоменклатуры") Тогда

		Если Документы.Найти(Основание) = Неопределено Тогда
			СтрокаДокумента = Документы.Добавить();
			СтрокаДокумента.УстановкаСкидокНоменклатуры = Основание;
		КонецЕсли;

	КонецЕсли;
КонецПроцедуры //ЗаполнитьПоОснованию()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

// Возвращает таблицу движений документов "УстановкаСкидокНоменклатуры",
// указанных в списке отмены, по номенклатуре
//
Функция ПодготовитьТаблицуДвиженийНоменклатура(СписокДокументов)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Регистраторы", СписокДокументов);
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	СкидкиНаценкиНоменклатуры.ПолучательСкидки,
	|	СкидкиНаценкиНоменклатуры.Номенклатура,
	|	СкидкиНаценкиНоменклатуры.ХарактеристикаНоменклатуры,
	|	СкидкиНаценкиНоменклатуры.Качество,
	|	СкидкиНаценкиНоменклатуры.Условие,
	|	СкидкиНаценкиНоменклатуры.ЗначениеУсловия,
	|	СкидкиНаценкиНоменклатуры.ОграничениеСкидкиНаценки,
	|	СкидкиНаценкиНоменклатуры.Валюта
	|ИЗ
	|	РегистрСведений.СкидкиНаценкиНоменклатуры КАК СкидкиНаценкиНоменклатуры
	|
	|ГДЕ
	|	СкидкиНаценкиНоменклатуры.Регистратор В(&Регистраторы)";

	Запрос.Текст = ТекстЗапроса;
	ТаблицаДвижений = Запрос.Выполнить().Выгрузить();

	Возврат ТаблицаДвижений;

КонецФункции //ПодготовитьТаблицуДвиженийНоменклатура()

// Возвращает таблицу движений документов "УстановкаСкидокНоменклатуры",
// указанных в списке отмены, по ценовым группам
//
Функция ПодготовитьТаблицуДвиженийЦеновыеГруппы(СписокДокументов)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Регистраторы", СписокДокументов);
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	СкидкиНаценкиПоЦеновымГруппам.ПолучательСкидки,
	|	СкидкиНаценкиПоЦеновымГруппам.ЦеноваяГруппа,
	|	СкидкиНаценкиПоЦеновымГруппам.Качество,
	|	СкидкиНаценкиПоЦеновымГруппам.Условие,
	|	СкидкиНаценкиПоЦеновымГруппам.ЗначениеУсловия,
	|	СкидкиНаценкиПоЦеновымГруппам.ОграничениеСкидкиНаценки,
	|	СкидкиНаценкиПоЦеновымГруппам.Валюта
	|ИЗ
	|	РегистрСведений.СкидкиНаценкиПоЦеновымГруппам КАК СкидкиНаценкиПоЦеновымГруппам
	|
	|ГДЕ
	|	СкидкиНаценкиПоЦеновымГруппам.Регистратор В(&Регистраторы)";

	Запрос.Текст = ТекстЗапроса;
	ТаблицаДвижений = Запрос.Выполнить().Выгрузить();

	Возврат ТаблицаДвижений;

КонецФункции //ПодготовитьТаблицуДвиженийЦеновыеГруппы()

// Возвращает таблицу движений документов "УстановкаСкидокНоменклатуры",
// указанных в списке отмены, по бонусам
//
Функция ПодготовитьТаблицуДвиженийБонусы(СписокДокументов)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Регистраторы", СписокДокументов);
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	СкидкиНоменклатурыНатуральные.ПолучательСкидки,
	|	СкидкиНоменклатурыНатуральные.Номенклатура,
	|	СкидкиНоменклатурыНатуральные.ХарактеристикаНоменклатуры,
	|	СкидкиНоменклатурыНатуральные.Количество,
	|	СкидкиНоменклатурыНатуральные.Качество
	|ИЗ
	|	РегистрСведений.СкидкиНоменклатурыНатуральные КАК СкидкиНоменклатурыНатуральные
	|
	|ГДЕ
	|	СкидкиНоменклатурыНатуральные.Регистратор В(&Регистраторы)";

	Запрос.Текст = ТекстЗапроса;
	ТаблицаДвижений = Запрос.Выполнить().Выгрузить();

	Возврат ТаблицаДвижений;

КонецФункции //ПодготовитьТаблицуДвиженийЦеновыеГруппы()

 // Выполняет движения по регистрам 
//
Процедура ДвиженияПоРегистрам(СтруктураШапкиДокумента, ТаблицаПоДокументамНоменклатура, ТаблицаПоДокументамЦеновыеГруппы, ТаблицаПоДокументамБонусы, Отказ, Заголовок)
	
	// Заполним таблицу движений по номенклатуре
	НаборДвижений   = Движения.СкидкиНаценкиНоменклатуры;
	ТаблицаДвижений = НаборДвижений.Выгрузить();
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТаблицаПоДокументамНоменклатура, ТаблицаДвижений);

	НаборДвижений.мПериод          = СтруктураШапкиДокумента.Дата;
	НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;
	
	Если (Не Отказ) Тогда
		Движения.СкидкиНаценкиНоменклатуры.ВыполнитьДвижения();
	КонецЕсли;
	
	// Заполним таблицу движений по ценовым группам
	НаборДвижений   = Движения.СкидкиНаценкиПоЦеновымГруппам;
	ТаблицаДвижений = НаборДвижений.Выгрузить();
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТаблицаПоДокументамЦеновыеГруппы, ТаблицаДвижений);
	
	НаборДвижений.мПериод          = СтруктураШапкиДокумента.Дата;
	НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;
	
	Если (Не Отказ) Тогда
		Движения.СкидкиНаценкиПоЦеновымГруппам.ВыполнитьДвижения();
	КонецЕсли;
	
	// Заполним таблицу движений по бонусам
	НаборДвижений   = Движения.СкидкиНоменклатурыНатуральные;
	ТаблицаДвижений = НаборДвижений.Выгрузить();
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ТаблицаПоДокументамБонусы, ТаблицаДвижений);
	
	НаборДвижений.мПериод          = СтруктураШапкиДокумента.Дата;
	НаборДвижений.мТаблицаДвижений = ТаблицаДвижений;
	
	Если (Не Отказ) Тогда
		Движения.СкидкиНоменклатурыНатуральные.ВыполнитьДвижения();
	КонецЕсли;
	
КонецПроцедуры // ДвиженияПоРегистрам()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Обработчик события "ОбработкаПроведения"
//
Процедура ОбработкаПроведения(Отказ, Режим)

	
	Если мУдалятьДвижения Тогда
		ttk_ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	КонецЕсли;

	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ttk_ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);

	// Сформируем структуру реквизитов шапки документа
	СтруктураШапкиДокумента = ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);

	// Заполним по шапке документа дерево параметров, нужных при проведении.
	ДеревоПолейЗапросаПоШапке = УправлениеЗапасами.СформироватьДеревоПолейЗапросаПоШапке();

	// Сформируем запрос на дополнительные параметры, нужные при проведении, по данным шапки документа
	СтруктураШапкиДокумента = УправлениеЗапасами.СформироватьЗапросПоДеревуПолей(ЭтотОбъект, ДеревоПолейЗапросаПоШапке, СтруктураШапкиДокумента, "");
	
	СтруктураОбязательныхПолей = Новый Структура("УстановкаСкидокНоменклатуры");
	// Теперь вызовем общую процедуру проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "Документы", СтруктураОбязательныхПолей, Отказ, Заголовок);

	СтруктураПолей = Новый Структура;
	СтруктураПолей.Вставить("УстановкаСкидокНоменклатуры", "УстановкаСкидокНоменклатуры");

	РезультатЗапросаПоДокументам = УправлениеЗапасами.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "Документы", СтруктураПолей);
	ТаблицаПоДокументамНоменклатура = ПодготовитьТаблицуДвиженийНоменклатура(РезультатЗапросаПоДокументам.Выгрузить().ВыгрузитьКолонку("УстановкаСкидокНоменклатуры"));
	ТаблицаПоДокументамЦеновыеГруппы = ПодготовитьТаблицуДвиженийЦеновыеГруппы(РезультатЗапросаПоДокументам.Выгрузить().ВыгрузитьКолонку("УстановкаСкидокНоменклатуры"));
	ТаблицаПоДокументамБонусы = ПодготовитьТаблицуДвиженийБонусы(РезультатЗапросаПоДокументам.Выгрузить().ВыгрузитьКолонку("УстановкаСкидокНоменклатуры"));

	Если ТаблицаПоДокументамНоменклатура.Количество() = 0
	   И ТаблицаПоДокументамЦеновыеГруппы.Количество() = 0
	   И ТаблицаПоДокументамБонусы.Количество() = 0 Тогда
	   ttk_ОбщегоНазначения.СообщитьОбОшибке("Не найдены движения по документам, указанным для отмены", Отказ, Заголовок);
	КонецЕсли;
	
	Если Не Отказ Тогда
		ДвиженияПоРегистрам(СтруктураШапкиДокумента, ТаблицаПоДокументамНоменклатура, ТаблицаПоДокументамЦеновыеГруппы, ТаблицаПоДокументамБонусы, Отказ, Заголовок);
	КонецЕсли;

КонецПроцедуры	// ОбработкаПроведения()

// Обработчик события "ОбработкаЗаполнения"
//
Процедура ОбработкаЗаполнения(Основание)

	ТипОснования = ТипЗнч(Основание);
	Если ТипОснования <> Тип("ДокументСсылка.УстановкаСкидокНоменклатуры") Тогда
		возврат;
	КонецЕсли;

	ЗаполнитьПоОснованию(Основание);

КонецПроцедуры //ОбработкаЗаполнения()

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;


	 
	мУдалятьДвижения = НЕ ЭтоНовый();
	
КонецПроцедуры // ПередЗаписью
